app/Controllers/AkunPerkiraan.php

    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->akunperkiraan->searchDataAkunPerkiraan($keyword);
        }else{
            $model =  $this->akunperkiraan;
        };

        $data = [
            'akunperkiraan'     => $model->getAkunPerkiraan()->paginate(10, 'metodepembayaran'),
            'pager'             => $model->pager,
            'xTipeAkun'         => $model->getTipeAkun()->getResult(),
            'breadcrumbs'       => "Akun Perkiraan",
            'title'             => "Akun Perkiraan | Reporta",
            'addNewButton'      => "Tambah Akun Perkiraan",
            'content'           => "Pages/VAkunPerkiraan"
        ];
---
SELECT *
FROM `akunperkiraan`
LEFT JOIN `tipeakun` ON `tipeAkunID` = `idTipeAkun`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `akunperkiraan`
LEFT JOIN `tipeakun` ON `tipeAkunID` = `idTipeAkun`