app/Controllers/MetodePembayaran.php

SELECT *
FROM `metodepembayaran`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `metodepembayaran`
---
    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->metodePembayaran->searchDataMetodePembayaran($keyword);
        }else{
            $model =  $this->metodePembayaran;
        };

        $data = [
            'metodePembayaran'  => $model->getMetodePembayaran()->paginate(10, 'metodepembayaran'),
            'pager'             => $model->pager,
            'breadcrumbs'       => "Metode Pembayaran",
            'title'             => "Metode Pembayaran | Reporta",
            'addNewButton'      => "Tambah Metode Pembayaran",
            'content'           => "Pages/VMetodePembayaran"
        ];