app/Controllers/Pembayaran.php

SELECT *
FROM `pembayaran`
JOIN `metodepembayaran` ON `metodePembayaranID` = `idMetodePembayaran`
RIGHT JOIN `datapembayaran` ON `pembayaranID` = `idPembayaran`
LEFT JOIN `akunperkiraan` ON `idAkunPerkiraan` = `akunPerkiraanID`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pembayaran`
JOIN `metodepembayaran` ON `metodePembayaranID` = `idMetodePembayaran`
RIGHT JOIN `datapembayaran` ON `pembayaranID` = `idPembayaran`
LEFT JOIN `akunperkiraan` ON `idAkunPerkiraan` = `akunPerkiraanID`
---
    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->Pembayaran->searchDataPembayaran($keyword);
        }else{
            $model =  $this->Pembayaran;
        };

        // $idPem = $idPem = $this->Pembayaran->get('pembayaranID');
        $idPem = '1';

        $data = [
            'Pembayaran'        => $model->getPembayaran()->paginate(10, 'pembayaran'),
            'pager'             => $model->pager,
            'metodePembayaran'  => $model->getMetodePembayaran()->getResult(),
            'akunPerkiraan'     => $model->getAkunPerkiraan()->getResult(),
            'dataPembayaran'    => $model->getDataPembayaran($idPem)->getResult(),
            'totalItem'         => $model->getTotalDataPembayaran(),
            'totalBiaya'        => "total Item",
            'breadcrumbs'       => "Pembayaran",
            'title'             => "Pembayaran | Reporta",
            'addNewButton'      => "Tambah Pembayaran",
            'content'           => "Pages/VPembayaran"
        ];