app/Controllers/Penerimaan.php

SELECT *
FROM `penerimaan`
JOIN `metodepembayaran` ON `metodePembayaranID` = `idMetodePembayaran`
RIGHT JOIN `datapenerimaan` ON `penerimaanID` = `idPenerimaan`
LEFT JOIN `akunperkiraan` ON `idAkunPerkiraan` = `akunPerkiraanID`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `penerimaan`
JOIN `metodepembayaran` ON `metodePembayaranID` = `idMetodePembayaran`
RIGHT JOIN `datapenerimaan` ON `penerimaanID` = `idPenerimaan`
LEFT JOIN `akunperkiraan` ON `idAkunPerkiraan` = `akunPerkiraanID`
---
    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->Penerimaan->searchDataPembayaran($keyword);
        }else{
            $model =  $this->Penerimaan;
        };

        // $idPem = $idPem = $this->Pembayaran->get('pembayaranID');
        $idPem = '1';

        $data = [
            'Penerimaan'        => $model->getPenerimaan()->paginate(10, 'penerimaan'),
            'pager'             => $model->pager,
            'metodePembayaran'  => $model->getMetodePembayaran()->getResult(),
            'akunPerkiraan'     => $model->getAkunPerkiraan()->getResult(),
            'dataPembayaran'    => $model->getDataPembayaran($idPem)->getResult(),
            'totalItem'         => $model->getTotalDataPembayaran(),
            'totalBiaya'        => "total Item",
            'breadcrumbs'       => "Penerimaan",
            'title'             => "Penerimaan | Reporta",
            'addNewButton'      => "Tambah Penerimaan",
            'content'           => "Pages/VPenerimaan"
        ];