app/Controllers/TipeAkun.php

    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->tipeAkun->searchDataTipeAkun($keyword);
        }else{
            $model =  $this->tipeAkun;
        };

        $data = [
            'tipeakun'          => $model->getTipeAkun()->paginate(10, 'tipeakun'),
            'pager'             => $model->pager,
            'breadcrumbs'       => "Tipe Akun",
            'title'             => "Tipe Akun | Reporta",
            'addNewButton'      => "Tambah Tipe Akun",
            'content'           => "Pages/VTipeAkun"
        ];
---
SELECT *
FROM `tipeakun`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tipeakun`