app/Models/MAkunPerkiraan.php

SELECT *
FROM `tipeakun`
---
    public function getTipeAkun(){
        $query = $this->db->table('tipeakun');
        return $query->get();