app/Models/MPenerimaan.php

SELECT COUNT(*) AS `numrows`
FROM `datapembayaran`
WHERE `idPembayaran` = '3'
---
    public function getTotalDataPembayaran(){
        $query = $this->db->table('datapembayaran')->where('idPembayaran', '3')->countAllResults();

SELECT *
FROM `metodepembayaran`
---
    public function getMetodePembayaran(){
        $query = $this->db->table('metodepembayaran');
        return $query->get();

SELECT *
FROM `akunperkiraan`
---
    public function getAkunPerkiraan(){
        $query = $this->db->table('akunperkiraan');
        return $query->get();